Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedNodeLoad.M Property
 Gets or sets the moment of the analysis decomposed node load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector M { get; set; }
Public Property M As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
AnalysisDecomposedNodeLoad Class
Tekla.Structures.Analysis Namespace